srmlite/template_srmMkdir_req.g2

@@
<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soapenv:Body>
    <ns1:srmMkdir soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="http://srm.lbl.gov/StorageResourceManager">
      <srmMkdirRequest xsi:type="ns1:srmMkdirRequest">
        <authorizationID xsi:type="xsd:string" xsi:nil="true"/>
        <SURL xsi:type="xsd:anyURI">$${SURL}</SURL>
        <storageSystemInfo xsi:type="ns1:ArrayOfTExtraInfo" xsi:nil="true"/>
      </srmMkdirRequest>
    </ns1:srmMkdir>
  </soapenv:Body>
</soapenv:Envelope>
@@
